id: 2c19455c-a0eb-4fc5-956f-19df1d29ec6d
name: AzActivity-ST | Public Access Enabled on Storage Account | Misconfiguration | [Az-ST]
version: 1.0.0
kind: Scheduled
description: |-
  Trigger:
  This detection triggers when public access is enabled on a storage account through the 'requestbody' field in the AzureActivity table.

  Risk:
  Enabling public access on a storage account his a high risk event and can lead to unintentional data loss. 

  Response:
  - Determine if this change was planned and if the content in the storage account is appropriate for public access.
  - If this change was unplanned, revert the change, investigate the InitiatingUPN, and review additional logs to determine if data was accessed unauthorized.
severity: High
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
- DefenseEvasion
- Collection
relevantTechniques:
- T1562.007
- T1530
query: |-
  AzureActivity
  | where OperationNameValue == "MICROSOFT.STORAGE/STORAGEACCOUNTS/WRITE"
  | extend parse_Properties = parse_json(Properties)
  | extend parse_requestBody = parse_json(tostring(parse_Properties.requestbody))
  | where parse_requestBody contains "allowBlobPublicAccess"
  | extend PublicAccess = tostring(parse_requestBody.properties.allowBlobPublicAccess)
  | where PublicAccess == "true"
  | project TimeGenerated, CorrelationId, Caller, CallerIpAddress, SubscriptionId, ResourceGroup, _ResourceId
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: Caller
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: CallerIpAddress
- entityType: AzureResource
  fieldMappings:
  - identifier: ResourceId
    columnName: _ResourceId
suppressionDuration: 5h

