id: 8ddafcc9-0df9-4a44-9650-ea99dfd5f5b3
name: AAD-App | Credential Added to AAD App Registration | RBE | [App]
version: 1.0.0
kind: Scheduled
description: |-
  Trigger:
  This detection triggers when a secret or certificate is added to an Azure AD app registration.

  Risk:
  Adversaries may add adversary-controlled credentials to a cloud account to maintain persistent access to victim accounts and instances within the environment.

  Response:
  - Investigate the initiating actor and application.
  - Determine if this activity is legitimate.
  - If the activity is not legitimate, remove the added credential, block the initiating actor, investigate activity from the app, and conduct further investigation into activity surrounding the event.
severity: Medium
queryFrequency: 15m
queryPeriod: 15m
triggerOperator: gt
triggerThreshold: 0
tactics:
- Persistence
relevantTechniques:
- T1098.001
query: |-
  AuditLogs
  | where OperationName == "Update application – Certificates and secrets management "
  | extend InitiatingUPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | extend UserAgent = tostring(AdditionalDetails[0].value)
  | extend AppObjectId = tostring(TargetResources[0].id)
  | extend AppDisplayName = tostring(TargetResources[0].displayName)
  | extend CredentialAdded = tostring(TargetResources[0].modifiedProperties[0].newValue)
  | project TimeGenerated, CorrelationId, InitiatingUPN, IPAddress, UserAgent, AppObjectId, AppDisplayName, CredentialAdded
suppressionEnabled: false
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
eventGroupingSettings:
  aggregationKind: SingleAlert
entityMappings:
- entityType: Account
  fieldMappings:
  - identifier: FullName
    columnName: InitiatingUPN
- entityType: IP
  fieldMappings:
  - identifier: Address
    columnName: IPAddress
- entityType: CloudApplication
  fieldMappings:
  - identifier: AppId
    columnName: AppObjectId
  - identifier: Name
    columnName: AppDisplayName
suppressionDuration: 5h

